In [2]:
import pandas as pd

In [2]:
countries = pd.Series(
    data = ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ'],
    name = 'countries'
)
display(countries)

UK       Англия
CA       Канада
US          США
RU       Россия
UA      Украина
BY     Беларусь
KZ    Казахстан
Name: countries, dtype: object

In [8]:
a = ["US", "CA"]

b = countries.loc[a]

print(b)

US       США
CA    Канада
Name: countries, dtype: object

In [9]:
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

countries_df.to_csv('data/countries.csv', index=False, sep=';')

In [3]:
countries_data = pd.read_csv('data/countries.csv', sep=';')
display(countries_data)

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [159]:
df = pd.DataFrame({'categorical': pd.Categorical(['d','e','f']),
                   'numeric': [1, 2, 3],
                   'object': ['a', 'b', 'c']
                  })
df.index = ["1", "2", "3"]
display(df)

  categorical  numeric object
1           d        1      a
2           e        2      b
3           f        3      c

In [60]:
melb_data = pd.read_csv('data/melb_data.csv', sep=',')

In [30]:
import numpy as np

In [61]:
# display(melb_data.columns)
# display (melb_data.loc[90, "Date"])

# display (round (melb_data.loc[3521, "Landsize"] / melb_data.loc[1690, "Landsize"],0))

# display (melb_data.head(8))
# display (melb_data.tail(7))

# display (melb_data.info())

count = 0

for i in melb_data.index:
    if pd.isna(melb_data.loc[i,"CouncilArea"]):
        count += 1
display (count)

1369

In [ ]:
melb_data['Car'] = melb_data['Car'].astype('int64')
melb_data['Bedroom'] = melb_data['Bedroom'].astype('int64')
melb_data['Bathroom'] = melb_data['Bathroom'].astype('int64')
melb_data['Propertycount'] = melb_data['Propertycount'].astype('int64')
melb_data['YearBuilt'] = melb_data['YearBuilt'].astype('int64')
melb_data.info()

In [56]:
melb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  int64
 12  Bathroom       13580 non-null  int64
 13  Car            13580 non-null  int64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  int64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  int64
 22  Coordinates    13580 non-null  object
dtypes: float64(6), int64(8), object(9)
memory usage: 2.4+ MB

In [70]:
melb_data.describe().loc[:, ['Price', 'Longtitude' , 'Lattitude']]

              Price    Longtitude     Lattitude
count  1.358000e+04  13580.000000  13580.000000
mean   1.075684e+06    144.995216    -37.809203
std    6.393107e+05      0.103916      0.079260
min    8.500000e+04    144.431810    -38.182550
25%    6.500000e+05    144.929600    -37.856822
50%    9.030000e+05    145.000100    -37.802355
75%    1.330000e+06    145.058305    -37.756400
max    9.000000e+06    145.526350    -37.408530

In [155]:
melb_data.describe()

,index,Rooms,Price,Distance,Postcode,Bedroom,Bathroom,Car,Landsize,BuildingArea,YearBuilt,Lattitude,Longtitude,Propertycount
count,13580.000000,13580.000000,1.358000e+04,13580.000000,13580.000000,13580.000000,13580.000000,13580.000000,13580.000000,13580.000000,13580.000000,13580.000000,13580.000000,13580.000000
mean,6789.500000,2.937997,1.075684e+06,10.137776,3105.301915,2.914728,1.534242,1.611856,558.416127,139.633972,1966.788218,-37.809203,144.995216,7454.417378
std,3920.352663,0.955748,6.393107e+05,5.868725,90.676964,0.965921,0.691712,0.960793,3990.669241,392.217403,29.088642,0.079260,0.103916,4378.581772
min,0.000000,1.000000,8.500000e+04,0.000000,3000.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1196.000000,-38.182550,144.431810,249.000000
25%,3394.750000,2.000000,6.500000e+05,6.100000,3044.000000,2.000000,1.000000,1.000000,177.000000,122.000000,1960.000000,-37.856822,144.929600,4380.000000
50%,6789.500000,3.000000,9.030000e+05,9.200000,3084.000000,3.000000,1.000000,2.000000,440.000000,126.000000,1970.000000,-37.802355,145.000100,6555.000000
75%,10184.250000,3.000000,1.330000e+06,13.000000,3148.000000,3.000000,2.000000,2.000000,651.000000,129.940000,1975.000000,-37.756400,145.058305,10331.000000
max,13579.000000,10.000000,9.000000e+06,48.100000,3977.000000,20.000000,8.000000,10.000000,433014.000000,44515.000000,2018.000000,-37.408530,145.526350,21650.000000

In [51]:
melb_data.describe(include=['object'])
# melb_data.loc[10:20, ["Price", "Suburb"]]

,Suburb,Address,Type,Method,SellerG,Date,CouncilArea,Regionname,Coordinates
count,13580,13580,13580,13580,13580,13580,12211,13580,13580
unique,314,13378,3,5,268,58,33,8,13097
top,Reservoir,36 Aberfeldie St,h,S,Nelson,27/05/2017,Moreland,Southern Metropolitan,"-37.8361, 144.9966"
freq,359,3,9449,9022,1565,473,1163,4695,12

In [64]:
#for i in melb_data.columns:
#    print(i)

display(melb_data.columns)

Index(['index', 'Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method',
       'SellerG', 'Date', 'Distance', 'Postcode', 'Bedroom', 'Bathroom', 'Car',
       'Landsize', 'BuildingArea', 'YearBuilt', 'CouncilArea', 'Lattitude',
       'Longtitude', 'Regionname', 'Propertycount', 'Coordinates'],
      dtype='object')

In [154]:
melb_data[['Longtitude', 'Lattitude']].value_counts()

Longtitude  Lattitude
144.99660   -37.83610    12
144.98500   -37.80350     8
144.94490   -37.84240     6
144.99060   -37.82310     5
144.94120   -37.84150     5
                         ..
144.96076   -37.76600     1
144.96079   -37.76733     1
144.96080   -37.77060     1
            -37.76162     1
145.52635   -37.64685     1
Length: 13097, dtype: int64

In [68]:
melb_data['Type'].value_counts(normalize=True)

h    0.695803
u    0.222165
t    0.082032
Name: Type, dtype: float64

In [162]:
melb_data['Bedroom'].mode()

0    3
Name: Bedroom, dtype: int64

In [169]:
round(melb_data['Distance'].std(), 0)

6.0

In [4]:
area_mean = melb_data['BuildingArea'].mean()
area_median = melb_data['BuildingArea'].median()

# display (area_mean, area_median)
display(round(100 * abs(area_median - area_mean) / area_mean, 0))

10.0

In [27]:
mask = melb_data['Price'] > 2000000
# display(mask)
display(melb_data[mask].shape[0])

1007

In [36]:
melb_data[melb_data['Bathroom'] == 0].shape[0]

34

In [33]:
melb_data[((melb_data['Rooms'] == 3) | (melb_data['BuildingArea'] > 100)) & (melb_data['Price'] < 300000)].shape[0]

68

In [39]:
melb_data[((melb_data['Price'] > 3e+6) & (melb_data['SellerG'] == "Nelson"))].shape[0]

5

In [34]:
mean_price = melb_data['Price'].mean()
melb_data[melb_data['Price'] > mean_price]['BuildingArea'].median()

126.0

In [42]:
# Минимальная цена участка без здания
melb_data[melb_data['BuildingArea'] == 0]['Price'].min()

412500.0

In [50]:
melb_data[(melb_data['Price'] < 1e+6) & ((melb_data['Rooms'] > 5) | (melb_data['YearBuilt'] > 2015))]['Price'].mean()

769238.6363636364

In [52]:
melb_data[(melb_data['Type'] == 'h') & (melb_data['Price'] < 3e+6)]['Regionname'].describe()

count                      9220
unique                        8
top       Northern Metropolitan
freq                       2737
Name: Regionname, dtype: object

In [55]:
students_data = pd.read_csv('data/students_performance.csv', sep=',')

In [59]:
students_data.head()
# students_data.columns

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [85]:
### ФИНАЛЬНЫЙ ТЕСТ МОДУЛЯ

# students_data.info()
# students_data.loc[155, 'writing score']
# students_data['math score'].mean()
# students_data['race/ethnicity'].value_counts()
# students_data[students_data['test preparation course'] == 'completed']['reading score'].mean()
# students_data[students_data['math score'] == 0].value_counts().shape[0]

# students_data[students_data['lunch'] == 'standard']['math score'].mean()
# students_data[students_data['lunch'] == 'free/reduced']['math score'].mean()

# students_data[students_data['parental level of education'] == 'bachelor\'s degree'].value_counts() # тут я экранирую кавычки символом \, а можно заключить в двойные кавычки ""
students_data['parental level of education'].value_counts()

# a = students_data[students_data['race/ethnicity'] == 'group A']['writing score'].median()
# b = students_data[students_data['race/ethnicity'] == 'group C']['writing score'].mean()
# display (round(abs(a-b),0))

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64